let handler = async (m, { conn, usedPrefix, command, text }) => {
    let img1 = 'https://telegra.ph/file/0e611ef0f5898f84e06ff.jpg';
    let img2 = 'https://telegra.ph/file/bd87aef51ebbbba4901c8.jpg';
    let img3 = 'https://telegra.ph/file/b9c7242b2ea534c9fea51.jpg';
    let img4 = 'https://telegra.ph/file/0e611ef0f5898f84e06ff.jpg';
    let img5 = 'https://telegra.ph/file/9ece2dc7647c5bc552f7a.jpg';
    let img6 = 'https://telegra.ph/file/5a22e9d6a3db8a26c2a8d.jpg';
    let img7 = 'https://telegra.ph/file/5122cb52f3d3e6a15d27d.jpg';
    let img8 = 'https://telegra.ph/file/7d69133c3dae7d2cb988e.jpg';
    let img9 = 'https://telegra.ph/file/7af98c215f23a0c7bfc6a.jpg';

    const messages = [
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الرومات ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*   
> *┤ 〚 .الجروب 〛*  
> *┤ 〚 .جروبي 〛*   
> *┤ 〚 .معلومات-الجروب 〛*   
> *┤ 〚 .اعدادات 〛*
> *┤ 〚 .لينك 〛*   
> *┤ 〚 .تغير-الاسم 〛*
> *┤ 〚 .تغير-الوصف 〛*
> *┤ 〚 .تغير-الخلفيه 〛* 
> *┤ 〚 .تغيير_اللينك 〛* 
> *┤ 〚 .تغيرالترحيب 〛* 
> *┤ 〚 .تغيرالوداع 〛*
> *╯────────────···*   
> *╮────────────···*   
> *┤ 〚 .ضيف 〛*
> *┤ 〚 .دعوه 〛*   
> *┤ 〚 .طرد 〛* 
> *┤ 〚 .شوت 〛* 
> *┤ 〚 .طرد_الاشباح 〛*
> *┤ 〚 .طرد_الارقام 〛* 
> *┤ 〚 .ترقيه 〛* 
> *┤ 〚 .تخفيض 〛* 
> *┤ 〚 .امسح 〛*   
> *┤ 〚 .فضح 〛*   
> *┤ 〚 .انذار 〛*   
> *┤ 〚 .حذف_انذار 〛*   
> *┤ 〚 .حذف_الانذارات 〛*   
> *┤ 〚 .الانذارات 〛*   
> *┤ 〚 .المشرفين 〛*   
> *┤ 〚 .منشن 〛*
> *┤ 〚 .لمنشن 〛*   
> *┤ 〚 .منشنلي 〛* 
> *┤ 〚 .مخفي 〛* 
> *┤ 〚 .وهمي 〛* 
> *┤ 〚 .فيك 〛*
> *┤ 〚 .عاهرة 〛*   
> *┤ 〚 .توب 〛* 
> *┤ 〚 .الاشباح 〛* 
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img1,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎الــقــــناه❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الأﻋـضـاء ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*
> *┤ 〚 .ابلاغ 〛*  
> *┤ 〚 .للمطور 〛*    
> *┤ 〚 .التفعيل 〛*   
> *┤ 〚 .تعريفي 〛*
> *┤ 〚 .تسجيل 〛*   
> *┤ 〚 .حذف-التسجيل 〛*
> *┤ 〚 .بروفايلي 〛*
> *┤ 〚 .لينكي 〛* 
> *┤ 〚 .اصلح 〛* 
> *┤ 〚 .تصليح 〛* 
> *┤ 〚 .تقييم 〛*    
> *┤ 〚 .الشخصيه 〛*    
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img2,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــناتــــي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامـر الالـعـاب ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*    
> *┤ 〚 .ألعاب 〛*  
> *┤ 〚 .ثقافة 〛*  
> *┤ 〚 .لوجوهات 〛*  
> *┤ 〚 .أحزر 〛*  
> *┤ 〚 .ألغاز 〛*  
> *┤ 〚 .إيموجي 〛*  
> *┤ 〚 .أنميات 〛*  
> *┤ 〚 .سؤال_أنمي 〛*  
> *┤ 〚 .رياضة 〛*  
> *┤ 〚 .كرة 〛*  
> *┤ 〚 .ذكاء 〛*  
> *┤ 〚 .علم 〛*  
> *┤ 〚 .عين 〛*  
> *┤ 〚 .فكك 〛*  
> *┤ 〚 .كت 〛*  
> *┤ 〚 .دين 〛*  
> *┤ 〚 .مسابقة 〛*  
> *┤ 〚 .مسابقة-صور 〛*  
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img3,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الــﻤــرح ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*    
> *┤ 〚 .تهكير 〛* 
> *┤ 〚 .تفجير 〛*  
> *┤ 〚 .اسئلني 〛* 
> *┤ 〚 .اسئلة 〛* 
> *┤ 〚 .أختبرني 〛* 
> *┤ 〚 .احرجني 〛* 
> *┤ 〚 .تحدانى 〛* 
> *┤ 〚 .الصراحه 〛* 
> *┤ 〚 .لوخيروك 〛* 
> *┤ 〚 .اقتباس 〛* 
> *┤ 〚 .اقتباس2 〛* 
> *┤ 〚 .شعر 〛* 
> *┤ 〚 .حكمة 〛* 
> *┤ 〚 .نصيحة 〛* 
> *┤ 〚 .بوستات 〛* 
> *┤ 〚 .غزل 〛* 
> *┤ 〚 .هبد 〛* 
> *┤ 〚 .تجرؤ 〛* 
> *┤ 〚 .العدوان 〛* 
> *┤ 〚 .فلسطين 〛* 
> *┤ 〚 .اصحاب 〛* 
> *┤ 〚 .الحب 〛* 
> *┤ 〚 .قلب 〛* 
> *┤ 〚 .بيحبني 〛* 
> *┤ 〚 .خطوبه 〛* 
> *┤ 〚 .زواج 〛* 
> *┤ 〚 .طلاق 〛* 
> *┤ 〚 .بيكرهني 〛* 
> *┤ 〚 .بيبضني 〛* 
> *┤ 〚 .قتل 〛* 
> *┤ 〚 .جريمه 〛* 
> *┤ 〚 .اعدام 〛* 
> *┤ 〚 .حياه 〛* 
> *┤ 〚 .وفاتي 〛* 
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img4,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الـتـسـلـيـة ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*    
> *┤ 〚 .هل 〛*   
> *┤ 〚 .كومنت 〛*  
> *┤ 〚 .تغريده 〛*  
> *┤ 〚 .بايدن 〛*
> *┤ 〚 .جميل 〛* 
> *┤ 〚 .جنس 〛* 
> *┤ 〚 .صفع 〛*  
> *┤ 〚 .شاذ 〛*      
> *┤ 〚 .شاذ2 〛*  
> *┤ 〚 .ليزبيان 〛*   
> *┤ 〚 .ليسبين 〛*   
> *┤ 〚 .شرموطة 〛* 
> *┤ 〚 .عاهرة 〛*    
> *┤ 〚 .شرموط 〛*   
> *┤ 〚 .رجوله 〛*   
> *┤ 〚 .انوثه 〛*   
> *┤ 〚 .مراهق 〛* 
> *┤ 〚 .مراهقة 〛* 
> *┤ 〚 .خلبوص 〛* 
> *┤ 〚 .خلبوصة 〛*   
> *┤ 〚 .فاشل 〛* 
> *┤ 〚 .فاشلة 〛*  
> *┤ 〚 .فار 〛* 
> *┤ 〚 .جبن 〛* 
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img5,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الــذکـاء ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*    
> *┤ 〚 .بوت 〛*
> *┤ 〚 .تربو 〛*
> *┤ 〚 .شات 〛*  
> *┤ 〚 .بلاك 〛*
> *┤ 〚 .سمسم 〛*  
> *┤ 〚 .تخيل 〛* 
> *┤ 〚 .ارسم 〛*  
> *┤ 〚 .احسب 〛* 
> *┤ 〚 .عمري 〛*
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢* `,
            img6,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الــتــصـﻤـيـم ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮────────────···*    
> *┤ 〚 .تصميم1 〛*
> *┤ 〚 .تصميم2 〛*  
> *┤ 〚 .تصميم3 〛*  
> *┤ 〚 .تصميم4 〛*
> *┤ 〚 .زخرفه 〛*  
> *┤ 〚 .خط 〛*
> *┤ 〚 .حقوق 〛* 
> *┤ 〚 .ملصق 〛*  
> *┤ 〚 .مكس 〛*      
> *┤ 〚 .لستيكر 〛*  
> *┤ 〚 .لصوره 〛* 
> *┤ 〚 .لفديو 〛* 
> *┤ 〚 .لجيف 〛* 
> *┤ 〚 .لصوت 〛*   
> *┤ 〚 .لريك 〛* 
> *┤ 〚 .لانمي 〛*  
> *┤ 〚 .لكرتون 〛* 
> *┤ 〚 .لجيف 〛* 
> *┤ 〚 .لرابط 〛*  
> *┤ 〚 .اختصار 〛* 
> *┤ 〚 .حذف-الخلفية 〛* 
> *┤ 〚 .باركود 〛* 
> *┤ 〚 .اقرء 〛* 
> *┤ 〚 .نسخ 〛*    
> *┤ 〚 .ترجم 〛*    
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img7,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر التنزبلات ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮───[  اوامـر التحميل ]───✧*
> *┤ 〚 .اغنيه 〛*
> *┤ 〚 .حملي 〛*  
> *┤ 〚 .ابحث 〛*  
> *┤ 〚 .يوتيوب 〛*
> *┤ 〚 .انستا 〛*  
> *┤ 〚 .تيك 〛*
> *┤ 〚 .صور-تيك 〛* 
> *┤ 〚 .بينترست 〛*  
> *┤ 〚 .صوره 〛* 
> *┤ 〚 .صور 〛* 
> *┤ 〚 .تصفح 〛* 
> *┤ 〚 .خلفيه 〛* 
> *┤ 〚 .خلفيات 〛* 
> *┤ 〚 .مود 〛* 
> *┤ 〚 .كروم 〛*      
> *┤ 〚 .ميديافاير 〛*  
> *┤ 〚 .مود 〛* 
> *┤ 〚 .بيك 〛* 
> *┤ 〚 .جيتهاب 〛*  
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
            img8,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ],
        [
`*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*
   *🐉✬⃝╿↫ اوامــر الرومات ↬╿⃝✬🐉*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*`,
`> *╮───[ اوامر الـبـحـث ]───✧*
> *┤ 〚 .ابحث 〛*  
> *┤ 〚 .جوجل 〛*    
> *┤ 〚 .جوجل-بلاي 〛*   
> *┤ 〚 .ويكيبيديا 〛*
> *┤ 〚 .ويكبيديا 〛*   
> *┤ 〚 .كيمياء 〛*
> *┤ 〚 .كتاب 〛*
> *┤ 〚 .اسم-الاغنيه 〛* 
> *┤ 〚 .كلمات 〛* 
> *┤ 〚 .انمي 〛*    
> *╯────────────···*
*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*
*⟣┈┈┈┈┈⟢┈┈┈⟣┈┈┈┈┈⟢*  `,
            img9,
            [], [],
            [['「❄ ╎الـمــطـور╎❄ 」', 'https://wa.me/201225655220'], ['「❄ ╎قــنــاتـي╎❄ 」', 'https://whatsapp.com/channel/0029VagKvPX4dTnNxfbTnR45']],
            []
        ]
    ];

    // إرسال رسالة الكيروسيل
    await conn.sendCarousel(m.chat, `بسم الله الرحمن الرحيم
> انا لست مسؤولا عن أي اسائة لاستخدام مزايا واوامــر البوت
*────────────────⟢*
*⤣🦈⤤يمنع استخدام البوت في الخاص*
*⤣🦈⤤يمنع شتم او سب البوت*
*⤣🦈⤤يمنع البحث عن محتوى اباحي بواسطة البوت*
*────────────────⟢*`, '*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*', '*✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪*', messages, m);
}

handler.command = /^(اوامر1)$/i; // Command to trigger the handler function

export default handler;