import fetch from 'node-fetch';
import fs from 'fs';

// Para configurar o idioma, na raiz do projeto altere o arquivo config.json
// Para configurar el idioma, en la raíz del proyecto, modifique el archivo config.json.
// To set the language, in the root of the project, modify the config.json file.

const handler = async (m, { conn, usedPrefix, __dirname, text, isPrems }) => {
  if (usedPrefix.toLowerCase() === 'a') return;

  try {
    const datas = global;
    const user = datas.db.data.users[m.sender];
    const idioma = user.language || 'default';
    const _translate = JSON.parse(fs.readFileSync(`./language/${idioma}.json`));
    const tradutor = _translate.plugins.menu_menu;

    // URLs for different languages
    const imageUrls = {
      'es': 'https://telegra.ph/file/744bc3124eaa81176347a.jpg',
      'pt-br': 'https://telegra.ph/file/744bc3124eaa81176347a.jpg',
      'fr': 'https://telegra.ph/file/744bc3124eaa81176347a.jpg',
      'en': 'https://telegra.ph/file/744bc3124eaa81176347a.jpg',
      'ru': 'https://telegra.ph/file/744bc3124eaa81176347a.jpg',
      'default': 'https://telegra.ph/file/744bc3124eaa81176347a.jpg'
    };

    // Get the appropriate image URL based on the language
    const imageUrl = imageUrls[idioma] || imageUrls['default'];

    // Fetch the image from the URL
    const response = await fetch(imageUrl);
    const buffer = await response.buffer();

    // Date and time formatting
    const d = new Date(new Date().getTime() + 3600000);
    const locale = 'es-ES';
    const week = d.toLocaleDateString(locale, { weekday: 'long' });
    const date = d.toLocaleDateString(locale, { day: '2-digit', month: '2-digit', year: 'numeric' });
    const _uptime = process.uptime() * 1000;
    const uptime = clockString(_uptime);
    const { money, joincount, exp, limit, level, role } = user;
    const rtotalreg = Object.values(global.db.data.users).filter(u => u.registered === true).length;
    const rtotal = Object.keys(global.db.data.users).length || '0';
    const taguser = '@' + m.sender.split('@')[0];
    const doc = ['pdf', 'zip', 'vnd.openxmlformats-officedocument.presentationml.presentation', 'vnd.openxmlformats-officedocument.spreadsheetml.sheet', 'vnd.openxmlformats-officedocument.wordprocessingml.document'];
    const document = doc[Math.floor(Math.random() * doc.length)];

    // Message content
    const str = `> *✧────[ 𝑾𝑬𝑳𝑪𝑶𝑴𝑬 ]────╮*
    > *┤ *مرحبا يا ${taguser}*
    > *┤ 🤴🏻 المطور: Mahmoud Mahmed*
    > *┤ #️⃣ الرقم: wa.me/201225655220*
    > *┤ ✅ الاصدار: 1.2.0*
    > *┤ 🎳 المستخدمين: ${rtotalreg}*  
    > *╯────────────···*   
    > *✧────[معـلـومـات الـمسـتـخـدم]────╮*
    > *┤ 🎩 الاسـم: ${user.name || 'غير مسجل'}*
    > *┤ 🔃 المستوي: ${level}*
    > *╯────────────···*    
    > *✧────[ الـوقـت والـتـاريـخ ]────╮*
    > *┤ 📆 التاريخ: ${date}*
    > *┤ 📅 اليوم: ${week}*
    > *┤ 🚀 وقت النشاط: ${uptime}*
    > *╯────────────···*
> ✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓┋✪
> *╮───[ اوامر الرومات ]───✧*
> *┤ 〚 .الجروب 〛*  
> *┤ 〚 .جروبي 〛*   
> *┤ 〚 .معلومات-الجروب 〛*   
> *┤ 〚 .اعدادات 〛*
> *┤ 〚 .لينك 〛*   
> *┤ 〚 .تغير-الاسم 〛*
> *┤ 〚 .تغير-الوصف 〛*
> *┤ 〚 .تغير-الخلفيه 〛* 
> *┤ 〚 .تغيير_اللينك 〛* 
> *┤ 〚 .تغيرالترحيب 〛* 
> *┤ 〚 .تغيرالوداع 〛*
> *╯────────────···*   
> *╮────────────···*   
> *┤ 〚 .ضيف 〛*
> *┤ 〚 .دعوه 〛*   
> *┤ 〚 .طرد 〛* 
> *┤ 〚 .شوت 〛* 
> *┤ 〚 .طرد_الاشباح 〛*
> *┤ 〚 .طرد_الارقام 〛* 
> *┤ 〚 .ترقيه 〛* 
> *┤ 〚 .تخفيض 〛* 
> *┤ 〚 .امسح 〛*   
> *┤ 〚 .فضح 〛*   
> *┤ 〚 .انذار 〛*   
> *┤ 〚 .حذف_انذار 〛*   
> *┤ 〚 .حذف_الانذارات 〛*   
> *┤ 〚 .الانذارات 〛*   
> *╯────────────···*   
> *╮────────────···*   
> *┤ 〚 .المشرفين 〛*   
> *┤ 〚 .منشن 〛*
> *┤ 〚 .لمنشن 〛*   
> *┤ 〚 .منشنلي 〛* 
> *┤ 〚 .مخفي 〛* 
> *┤ 〚 .وهمي 〛* 
> *┤ 〚 .فيك 〛*
> *┤ 〚 .عاهرة 〛*   
> *┤ 〚 .توب 〛* 
> *┤ 〚 .الاشباح 〛* 
> *╯────────────···*   
> *╮───[ اوامر الالقاب ]───✧*
> *┤ .تسجيل.* 
> *┤ { تضع القب بعد الامر للادمن فقط }*
> *┤ .لقبي.*
> *┤ { لمعرفة لقبك المسجل }*
> *┤ .لقبه.* 
> *┤ { لمعرفة لقب شخص للادمن فقط }*
> *┤ .الالقاب.* 
> *┤ { لمعرفة الالقاب المسجله }*
> *┤ .حذف_لقب.*
> *┤ { لحذف لقب من الالقاب المسجله }*
> *╯────────────···* 
> *╮───[ الاوامــر الاسـلامـيـة]───✧*
> *┤ 〚 .الله 〛*
> *┤ 〚 .القران 〛*  
> *┤ 〚 .قران 〛*  
> *┤ 〚 .سوره 〛*
> *┤ 〚 .ايات 〛*  
> *┤ 〚 .حديث 〛*
> *┤ 〚 .احاديث 〛*  
> *┤ 〚 .اذكار الصباح 〛*  
> *┤ 〚 .اذكار المساء 〛*  
> *┤ 〚 .اذكار النوم 〛*  
> *╯────────────···*  
> *╮───[ اوامـر الــتــصـﻤـيـم ]───✧*
> *┤ 〚 .تصميم1 〛*
> *┤ 〚 .تصميم2 〛*  
> *┤ 〚 .تصميم3 〛*  
> *┤ 〚 .تصميم4 〛*
> *┤ 〚 .زخرفه 〛*  
> *┤ 〚 .خط 〛*
> *╯────────────···*  
> *╮──[ اوامـر الــتـحـوﯾـلات ]──✧* 
> *┤ 〚 .حقوق 〛* 
> *┤ 〚 .ملصق 〛*  
> *┤ 〚 .مكس 〛*      
> *┤ 〚 .لستيكر 〛*  
> *┤ 〚 .لصوره 〛* 
> *┤ 〚 .لفديو 〛* 
> *┤ 〚 .لجيف 〛* 
> *┤ 〚 .لصوت 〛*   
> *┤ 〚 .لريك 〛* 
> *┤ 〚 .لانمي 〛*  
> *┤ 〚 .لكرتون 〛* 
> *┤ 〚 .لجيف 〛* 
> *┤ 〚 .لرابط 〛*  
> *┤ 〚 .اختصار 〛* 
> *┤ 〚 .حذف-الخلفية 〛* 
> *┤ 〚 .باركود 〛* 
> *┤ 〚 .اقرء 〛* 
> *┤ 〚 .نسخ 〛*    
> *┤ 〚 .ترجم 〛*    
> *╯────────────···* 
 *╮───[ اوامـر الالـعـاب ]───✧*
> *┤ 〚 .ألعاب 〛*  
> *┤ 〚 .ثقافة 〛*  
> *┤ 〚 .لوجوهات 〛*  
> *┤ 〚 .أحزر 〛*  
> *┤ 〚 .ألغاز 〛*  
> *┤ 〚 .إيموجي 〛*  
> *┤ 〚 .أنميات 〛*  
> *┤ 〚 .سؤال_أنمي 〛*  
> *┤ 〚 .رياضة 〛*  
> *┤ 〚 .كرة 〛*  
> *┤ 〚 .ذكاء 〛*  
> *┤ 〚 .علم 〛*  
> *┤ 〚 .عين 〛*  
> *┤ 〚 .فكك 〛*  
> *┤ 〚 .كت 〛*  
> *┤ 〚 .دين 〛*  
> *┤ 〚 .مسابقة 〛*  
> *┤ 〚 .مسابقة-صور 〛*  
> *╯────────────···*
> *╮───[ اوامـر الـجـيـﻤـز ]───✧*
> *┤ 〚 .اكس_او 〛*   
> *┤ 〚 .كنسل 〛*  
> *┤ 〚 .تحدي 〛*  
> *┤ 〚 .لاعبني 〛*   
> *┤ 〚 .جنيه 〛*   
> *┤ 〚 .المتفجرات 〛*   
> *┤ 〚 .سلم-وثعبان 〛*   
> *┤ 〚 .شطرنج 〛*   
> *┤ 〚 .رياضيات 〛*
> *╯────────────···*   
> *╮────────────···*    
> *┤ 〚 .بلاك-جاك 〛*    
> *┤ 〚 .دوران 〛*    
> *┤ 〚 .رهان 〛*    
> *┤ 〚 .روليت 〛*    
> *┤ 〚 .روليت_حظر 〛*    
> *┤ 〚 .مغامره 〛*    
> *╯────────────···*   
> *╮───[ اوامـر الـﻤـرح ]───✧*
> *┤ 〚 .هل 〛*   
> *┤ 〚 .كومنت 〛*  
> *┤ 〚 .تغريده 〛*  
> *┤ 〚 .بايدن 〛*
> *╯────────────···*   
> *╮────────────···*     
> *┤ 〚 .جميل 〛* 
> *┤ 〚 .جنس 〛* 
> *┤ 〚 .صفع 〛*  
> *┤ 〚 .شاذ 〛*      
> *┤ 〚 .شاذ2 〛*  
> *┤ 〚 .ليزبيان 〛*   
> *┤ 〚 .ليسبين 〛*   
> *┤ 〚 .شرموطة 〛* 
> *┤ 〚 .عاهرة 〛*    
> *┤ 〚 .شرموط 〛*   
> *┤ 〚 .رجوله 〛*   
> *┤ 〚 .انوثه 〛*   
> *┤ 〚 .مراهق 〛* 
> *┤ 〚 .مراهقة 〛* 
> *┤ 〚 .خلبوص 〛* 
> *┤ 〚 .خلبوصة 〛*   
> *┤ 〚 .فاشل 〛* 
> *┤ 〚 .فاشلة 〛*  
> *┤ 〚 .فار 〛* 
> *┤ 〚 .جبن 〛* 
> *╯────────────···* 
> *╮────────────···*     
> *┤ 〚 .تهكير 〛* 
> *┤ 〚 .تفجير 〛* 
> *╯────────────···*
> *╮────────────···*     
> *┤ 〚 .اسئلني 〛* 
> *┤ 〚 .اسئلة 〛* 
> *┤ 〚 .أختبرني 〛* 
> *┤ 〚 .احرجني 〛* 
> *┤ 〚 .تحدانى 〛* 
> *┤ 〚 .الصراحه 〛* 
> *┤ 〚 .لوخيروك 〛* 
> *┤ 〚 .اقتباس 〛* 
> *┤ 〚 .اقتباس2 〛* 
> *┤ 〚 .شعر 〛* 
> *┤ 〚 .حكمة 〛* 
> *┤ 〚 .نصيحة 〛* 
> *┤ 〚 .بوستات 〛* 
> *┤ 〚 .غزل 〛* 
> *┤ 〚 .هبد 〛* 
> *┤ 〚 .تجرؤ 〛* 
> *┤ 〚 .العدوان 〛* 
> *┤ 〚 .فلسطين 〛* 
> *╯────────────···*
> *╮────────────···*     
> *┤ 〚 .اصحاب 〛* 
> *┤ 〚 .الحب 〛* 
> *┤ 〚 .قلب 〛* 
> *┤ 〚 .بيحبني 〛* 
> *┤ 〚 .خطوبه 〛* 
> *┤ 〚 .زواج 〛* 
> *┤ 〚 .طلاق 〛* 
> *┤ 〚 .بيكرهني 〛* 
> *┤ 〚 .بيبضني 〛* 
> *┤ 〚 .قتل 〛* 
> *┤ 〚 .جريمه 〛* 
> *┤ 〚 .اعدام 〛* 
> *┤ 〚 .حياه 〛* 
> *┤ 〚 .وفاتي 〛* 
> *╯────────────···* 
> *╮───[ اوامـر الــذکـاء]───✧*
> *┤ 〚 .بوت 〛*
> *┤ 〚 .تربو 〛*
> *┤ 〚 .شات 〛*  
> *┤ 〚 .بلاك 〛*
> *┤ 〚 .سمسم 〛*  
> *┤ 〚 .تخيل 〛* 
> *┤ 〚 .ارسم 〛*  
> *┤ 〚 .احسب 〛* 
> *┤ 〚 .عمري 〛*
> *╯────────────···*
> *╮───[  اوامـر التحميل ]───✧*
> *┤ 〚 .اغنيه 〛*
> *┤ 〚 .حملي 〛*  
> *┤ 〚 .ابحث 〛*  
> *┤ 〚 .يوتيوب 〛*
> *┤ 〚 .انستا 〛*  
> *┤ 〚 .تيك 〛*
> *┤ 〚 .صور-تيك 〛* 
> *┤ 〚 .بينترست 〛*  
> *┤ 〚 .صوره 〛* 
> *┤ 〚 .صور 〛* 
> *┤ 〚 .تصفح 〛* 
> *┤ 〚 .خلفيه 〛* 
> *┤ 〚 .خلفيات 〛* 
> *┤ 〚 .مود 〛* 
> *┤ 〚 .كروم 〛*      
> *┤ 〚 .ميديافاير 〛*  
> *┤ 〚 .مود 〛* 
> *┤ 〚 .بيك 〛* 
> *┤ 〚 .جيتهاب 〛*  
> *╯────────────···*
> *╮───[ اوامر الـبـحـث ]───✧*
> *┤ 〚 .ابحث 〛*  
> *┤ 〚 .جوجل 〛*    
> *┤ 〚 .جوجل-بلاي 〛*   
> *┤ 〚 .ويكيبيديا 〛*
> *┤ 〚 .ويكبيديا 〛*   
> *┤ 〚 .كيمياء 〛*
> *┤ 〚 .كتاب 〛*
> *┤ 〚 .اسم-الاغنيه 〛* 
> *┤ 〚 .كلمات 〛* 
> *┤ 〚 .انمي 〛*    
> *╯────────────···*
> *╮───[ اوامر الصوت ]───✧*
> *┤〚 .سنجاب 〛*
> *┤〚 .سلس 〛*
> *┤〚 .بطئ 〛*
> *┤〚 .الي 〛*
> *┤〚 .عكس 〛*
> *┤〚 .تسريع-بسيط 〛*
> *┤〚 .سريع 〛*
> *┤〚 .تحسين 〛*
> *┤〚 .منفوخ 〛*
> *┤〚 .عميق 〛*
> *┤〚 .عميق2 〛*
> *╯────────────···*
> *╮───[ اوامر الأﻋـضـاء ]───✧*
> *┤ 〚 .ابلاغ 〛*  
> *┤ 〚 .للمطور 〛*    
> *┤ 〚 .التفعيل 〛*   
> *┤ 〚 .تعريفي 〛*
> *┤ 〚 .تسجيل 〛*   
> *┤ 〚 .حذف-التسجيل 〛*
> *┤ 〚 .بروفايلي 〛*
> *┤ 〚 .لينكي 〛* 
> *┤ 〚 .اصلح 〛* 
> *┤ 〚 .تصليح 〛* 
> *┤ 〚 .تقييم 〛*    
> *┤ 〚 .الشخصيه 〛*    
> *╯────────────···*
> *╮───[ اوامــر الــبــنــك]───✧*
> *┤ 〚 .البنك 〛*
> *┤ 〚 .ايداع 〛*
> *┤ 〚 .سحب 〛*  
> *┤ 〚 .تحويل 〛*
> *╯────────────···* 
> *╮────────────···*    
> *┤ 〚 .اهداء 〛*  
> *┤ 〚 .عمل 〛*  
> *┤ 〚 .راتب 〛*  
> *┤ 〚 .عملات 〛*  
> *┤ 〚 .عملاتي 〛*  
> *┤ 〚 .تعدين 〛*  
> *┤ 〚 .تعدين2 〛*
> *┤ 〚 .هجوم 〛*  
> *┤ 〚 .صندوق 〛*  
> *┤ 〚 .يومي 〛* 
> *┤ 〚 .اسبوعي 〛*
> *╯────────────···* 
> *╮────────────···*    
> *┤ 〚 .المحفظة 〛*  
> *┤ 〚 .الرتبة 〛* 
> *┤ 〚 .المتصدرين 〛*   
> *╯────────────···* 
> *╮────────────···*    
> *┤ 〚 .تسوق 〛*  
> *┤ 〚 .شراء 〛* 
> *┤ 〚 .شراء-الماس 〛*  
> *┤ 〚 .شراء_الدجاج 〛*  
> *┤ 〚 .لجواهر 〛*
> *╯────────────···* 
 ✪┋𝐁𝐘┋❥ 𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓 ┋✪`;

    await conn.sendMessage(m.chat, { image: { url: img }, caption: str, mentions: [m.sender] }, { quoted: global.fcontact });
};

function clockString(ms) {
    let h = Math.floor(ms / 3600000);
    let m = Math.floor((ms % 3600000) / 60000);
    let s = Math.floor((ms % 60000) / 1000);
    return [h, m, s].map(v => v.toString().padStart(2, 0)).join(':');
}

handler.help = ['menu'];
handler.tags = ['main'];
handler.command = /^(10)$/i;
handler.owner = false;
handler.mods = false;
handler.premium = false;
handler.group = false;
handler.private = false;

export default handler;
