export async function all(m) {
// عندما يرسل شخص ما رابط مجموعة إلى رسائل الخاصة للبوت/
if ((m.mtype === 'groupInviteMessage' || m.text.startsWith('https://chat') || m.text.startsWith('open this link')) && !m.isBaileys && !m.isGroup) {

m.reply(`> *📍↵ قوانين دخول بوت التربو جروبك ↯*
> *┓━━━━━━━━━━━━━━━━┣*
> *┃📌↵‏(1)↜ بوت التربو مش هيخش*
> *┃جروب فيه أقل من 50 عضو.*
> *┫━━━━━━━━━━━━━━━━┣*
> *┃📌↵‏(2)↜ مفيش حاجة اسمها*
> *┃ تنافس بوتات.*
> *┃لو لقيت بوت غير التربو، اعتبره برا*
> *┫━━━━━━━━━━━━━━━━┣*
> *┃📌↵‏(3)↜ استخدام البوت بعقل وبلاش اسبام*
> *┫━━━━━━━━━━━━━━━━┣*
> *┃📌↵‏(4)↜ البوت مش للمنشن*
> *┃الجماعي وخلاص.*
> *┃لو ده هدفك، يبقى خلي البوت بعيد*
> *┫━━━━━━━━━━━━━━━━┣*
> *┃📌↵‏(5)↜ ممنوع تستخدم حاجات*
> *┃ خارجة أو كلام مالوش لازمة.*
> *┃احترم نفسك ونحافظ على الروقان*
> *┫━━━━━━━━━━━━━━━━┣*
> *┃📌↵‏(6)↜ أي شكوى أو استفسار*
> *┃ يبقى مع المطور.*
> *┃ دا رقم المطور*
                  wa.me/+201225655220 ┃ 
> *┫━━━━━━━━━━━━━━━━┣*
> _*٭.  ❞𝐓𝐀𝐑𝐁𝐎𝐎☞𝐁𝐎𝐓❝ .٭*_ 
`)
m.react('💎')
const data = global.owner.filter(([id, isCreator]) => id && isCreator)
this.sendContact(m.chat, data.map(([id, name]) => [id, name]), m)
}

return !0
}